def area(a):
    # Возвращает площадь квадрата по длине его стороны (a)

        # Параметры:
            # a (float): длина стороны квадрата

        # Возвращаемое значение:
            # (float): площадь квадрата
            
    return a * a


def perimeter(a):
    # Возвращает периметр квадрата по длине его стороны (a)

        # Параметры:
            # a (float): длина стороны квадрата

        # Возвращаемое значение:
            # (float): периметр квадрата
            
    return 4 * a
