def area(a, b, c):
    # Возвращает полупериметр треугольника по длинам его сторон (a, b, c)

        # Параметры:
            # a (float): длина первой стороны треугольника
            # b (float): длина второй стороны треугольника
            # c (float): длина третьей стороны треугольника

        # Возвращаемое значение:
            # (float): полупериметр треугольника
            
    return (a + b + c) / 2


def perimeter(a, b, c):
    # Возвращает периметр треугольника по длинам его сторон (a, b, c)

        # Параметры:
            # a (float): длина первой стороны треугольника
            # b (float): длина второй стороны треугольника
            # c (float): длина третьей стороны треугольника

        # Возвращаемое значение:
            # (float): периметр треугольника
    
    return a + b + c
